app/controllers/gen_trees_controller.rb

SELECT  "gen_trees".* FROM "gen_trees"  WHERE "gen_trees"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @tree = GenTree.find(params[:id])

SELECT "nodes".* FROM "nodes"  WHERE "nodes"."gen_tree_id" = 1
---
  def getNodes
    nodes = Node.where(gen_tree_id: params[:id])