app/controllers/trees_controller.rb

SELECT "nodes".* FROM "nodes"
---
	def getNodes
		nodes = Node.all