app/controllers/user_sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" IS NULL LIMIT 1
---
  def create
    user = User.find_by(email: params[:user][:email])