app/controllers/users_controller.rb

INSERT INTO "users" ("alias", "created_at", "email", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)  [["alias", "Andre"], ["created_at", "2014-04-25 19:23:14.717991"], ["email", "andre.luis.iasi.moura@gmail.com"], ["password_digest", "12345"], ["updated_at", "2014-04-25 19:23:14.717991"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    @user.destroy

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_user
      @user = User.find(params[:id])